CDA-FO-EPRESCRIPTION/Exemple/ep-med/e-prescription_structure_flux_Prescripteur_XML_v02.00/creerEPrescription-Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:siram:lps:ctxlps" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:urn1="urn:ir:se_creerepresc" xmlns:urn2="urn:ir:creerepresc" xmlns:urn3="urn:ir:e_prescr">
   <soap:Header/>
   <soap:Body>
      <urn1:SE_CREEREPRESCR>
         <!--Optional: EF_EP4_E401.01-->
         <urn2:VersionNorme>?</urn2:VersionNorme>
         <!--Zero or more repetitions:EF_EP4_E403-->
         <urn2:PRESCRIPTION>
            <!--Optional:EF_EP4_E403.02-->
            <urn2:Numero>?</urn2:Numero>
            <!--Optional:EF_EP4_E403.01-->
            <urn2:Date>?</urn2:Date>
            <!--Optional:EF_EP4_E403.04-->
            <urn2:Type>?</urn2:Type>
            <!--Optional:EF_EP4_E403.05-->
            <urn2:NbLignes>?</urn2:NbLignes>
            <!--Optional:EF_EP4_E403.06-->
            <urn2:Consentement>?</urn2:Consentement>
            <!--Optional:EF_EP4_E403.07-->
            <urn2:Domicile>?</urn2:Domicile>
            <!--Optional:EF_EP4_E403.08-->
            <urn2:Urgence>?</urn2:Urgence>
            <!--Optional:EF_EP4_E403.10-->
            <urn2:Militaire>?</urn2:Militaire>
            <!--Optional:EF_EP4_E403.11-->
            <urn2:DateHeureSouhaiteeActe>?</urn2:DateHeureSouhaiteeActe>
            <!--Optional:EF_EP4_E403.09-->
            <urn2:SousType>?</urn2:SousType>
            <!--Optional:EF_EP4_E413-->
            <urn2:CONTENUPRESCRIPTION>
               <!--Zero or more repetitions:EF_EP4_E406-->
               <urn3:LIGMEDICAMENTEUX>
                  <!--Optional:EF_EP4_E406.01-->
                  <urn3:NumLigne>?</urn3:NumLigne>
                  <!--Optional:EF_EP4_E406.02-->
                  <urn3:TypeEltPrescrit>?</urn3:TypeEltPrescrit>
                  <!--Optional:EF_EP4_E406.05-->
                  <urn3:NbConditionnement>?</urn3:NbConditionnement>
                  <!--Optional:EF_EP4_E406.06-->
                  <urn3:NbRenouv>?</urn3:NbRenouv>
                  <!--Optional:EF_EP4_E406.09-->
                  <urn3:EstEnRapportALD>?</urn3:EstEnRapportALD>
                  <!--Optional:EF_EP4_E406.10-->
                  <urn3:EstEnRapportAccident>?</urn3:EstEnRapportAccident>
                  <!--Optional:EF_EP4_E406.15-->
                  <urn3:EstEnRapportPrev>?</urn3:EstEnRapportPrev>
                  <!--Optional:EF_EP4_E406.03-->
                  <urn3:CIP>?</urn3:CIP>
                  <!--Optional:EF_EP4_E406.14-->
                  <urn3:IdMVN>?</urn3:IdMVN>
                  <!--Optional:EF_EP4_E406.16-->
                  <urn3:Medicabase>?</urn3:Medicabase>
                  <!--Optional:EF_EP4_E406.17-->
                  <urn3:Specialite>?</urn3:Specialite>
                  <!--Optional:EF_EP4_E406.04-->
                  <urn3:Molecules>?</urn3:Molecules>
                  <!--Optional:EF_EP4_E406.07-->
                  <urn3:Duree>?</urn3:Duree>
                  <!--Optional:EF_EP4_E406.08-->
                  <urn3:Posologie>?</urn3:Posologie>
                  <!--Optional:EF_EP4_E406.13-->
                  <urn3:EstNonRemb>?</urn3:EstNonRemb>
                  <!--Optional:EF_EP4_E406.11-->
                  <urn3:EstNonSub>?</urn3:EstNonSub>
                  <!--Optional:EF_EP4_E406.18-->
                  <urn3:MotifNonSub>?</urn3:MotifNonSub>
                  <!--Optional:EF_EP4_E406.12-->
                  <urn3:EstHorsAMM>?</urn3:EstHorsAMM>
                  <!--Optional:EF_EP4_E406.19-->
                  <urn3:TrtAntiBio>?</urn3:TrtAntiBio>
                  <!--Optional:EF_EP4_E406.20-->
                  <urn3:RTU>?</urn3:RTU>
                  <!--Optional:EF_EP4_E406.22-->
                  <urn3:DCM>?</urn3:DCM>
                  <!--Optional:EF_EP4_E406.21-->
                  <urn3:CommentairePM>?</urn3:CommentairePM>
               </urn3:LIGMEDICAMENTEUX>
               <!--Zero or more repetitions:EF_EP4_E407-->
               <urn3:LIGDISPOSITIFMEDICAL>
                  <!--Optional:EF_EP4_E407.01-->
                  <urn3:NumLigne>?</urn3:NumLigne>
                  <!--Optional:EF_EP4_E407.04-->
                  <urn3:NbConditionnement>?</urn3:NbConditionnement>
                  <!--Optional:EF_EP4_E407.10-->
                  <urn3:DureeLocationLPP>?</urn3:DureeLocationLPP>
                  <!--Optional:EF_EP4_E407.05-->
                  <urn3:NbRenouv>?</urn3:NbRenouv>
                  <!--Optional:EF_EP4_E407.06-->
                  <urn3:EstEnRapportALD>?</urn3:EstEnRapportALD>
                  <!--Optional:EF_EP4_E407.07-->
                  <urn3:EstEnRapportAccident>?</urn3:EstEnRapportAccident>
                  <!--Optional:EF_EP4_E407.11-->
                  <urn3:EstEnRapportPrev>?</urn3:EstEnRapportPrev>
                  <!--Optional:EF_EP4_E407.08-->
                  <urn3:EstNonRemb>?</urn3:EstNonRemb>
                  <!--Optional:EF_EP4_E407.03-->
                  <urn3:CodeLPP>?</urn3:CodeLPP>
                  <!--Optional:EF_EP4_E407.09-->
                  <urn3:CodeACL>?</urn3:CodeACL>
                  <!--Optional:EF_EP4_E407.17-->
                  <urn3:CodeIndexACL7>?</urn3:CodeIndexACL7>
                  <!--Optional:EF_EP4_E407.12-->
                  <urn3:CodeREF13>?</urn3:CodeREF13>
                  <!--Optional:EF_EP4_E407.13-->
                  <urn3:CodeUDI>?</urn3:CodeUDI>
                  <!--Optional:EF_EP4_E407.14-->
                  <urn3:LibelleMarque>?</urn3:LibelleMarque>
                  <!--Optional:EF_EP4_E407.15-->
                  <urn3:LibelleLPPLibre>?</urn3:LibelleLPPLibre>
                  <!--Optional:EF_EP4_E407.16-->
                  <urn3:DCM>?</urn3:DCM>
               </urn3:LIGDISPOSITIFMEDICAL>
               <!--Zero or more repetitions:EF_EP4_E408-->
               <urn3:LIGKINE>
                  <!--Optional:EF_EP4_E408.01-->
                  <urn3:NumLigne>?</urn3:NumLigne>
                  <!--Optional:EF_EP4_E408.02-->
                  <urn3:Detail>?</urn3:Detail>
                  <!--Optional:EF_EP4_E408.03-->
                  <urn3:EstEnRapportALD>?</urn3:EstEnRapportALD>
                  <!--Optional:EF_EP4_E408.04-->
                  <urn3:EstEnRapportAccident>?</urn3:EstEnRapportAccident>
                  <!--Optional:EF_EP4_E408.05-->
                  <urn3:EstEnRapportPrev>?</urn3:EstEnRapportPrev>
                  <!--Optional:EF_EP4_E408.06-->
                  <urn3:EstNonRemb>?</urn3:EstNonRemb>
                  <!--Optional:EF_EP4_E408.07-->
                  <urn3:EstHN>?</urn3:EstHN>
                  <!--Optional:EF_EP4_E408.08-->
                  <urn3:DCM>?</urn3:DCM>
               </urn3:LIGKINE>
               <!--Zero or more repetitions:EF_EP4_E409-->
               <urn3:LIGBIO>
                  <!--Optional:Balise non utilisée-->
                  <urn3:LOINCBIO>
                     <!--Optional:Balise non utilisée-->
                     <urn3:CodeNABM>?</urn3:CodeNABM>
                     <!--Optional:Balise non utilisée-->
                     <urn3:Libelle>?</urn3:Libelle>
                     <!--Optional:Balise non utilisée-->
                     <urn3:Synonyme>?</urn3:Synonyme>
                     <!--Optional:Balise non utilisée-->
                     <urn3:Code>?</urn3:Code>
                     <!--Optional:Balise non utilisée-->
                     <urn3:LibelleReference>?</urn3:LibelleReference>
                     <!--Optional:Balise non utilisée-->
                     <urn3:Order>?</urn3:Order>
                     <!--Optional:Balise non utilisée-->
                     <urn3:Nature>?</urn3:Nature>
                     <!--Optional:Balise non utilisée-->
                     <urn3:Localisation>?</urn3:Localisation>
                     <!--Optional:Balise non utilisée-->
                     <urn3:Associe>?</urn3:Associe>
                     <!--Optional:Balise non utilisée-->
                     <urn3:Valeurs>?</urn3:Valeurs>
                     <!--Optional:Balise non utilisée-->
                     <urn3:DateValidation>?</urn3:DateValidation>
                     <!--Optional:Balise non utilisée-->
                     <urn3:VersionVP>?</urn3:VersionVP>
                     <!--Optional:Balise non utilisée-->
                     <urn3:Statut>?</urn3:Statut>
                  </urn3:LOINCBIO>
                  <!--Optional:EF_EP4_E409.01-->
                  <urn3:NumLigne>?</urn3:NumLigne>
                  <!--Optional:EF_EP4_E409.02-->
                  <urn3:Detail>?</urn3:Detail>
                  <!--Optional:EF_EP4_E409.03-->
                  <urn3:NbRenouv>?</urn3:NbRenouv>
                  <!--Optional:EF_EP4_E409.23-->
                  <urn3:FreqRenouv>?</urn3:FreqRenouv>
                  <!--Optional:EF_EP4_E409.24-->
                  <urn3:AJeun>?</urn3:AJeun>
                  <!--Optional:EF_EP4_E409.04-->
                  <urn3:EstEnRapportALD>?</urn3:EstEnRapportALD>
                  <!--Optional:EF_EP4_E409.05-->
                  <urn3:EstEnRapportAccident>?</urn3:EstEnRapportAccident>
                  <!--Optional:EF_EP4_E409.06-->
                  <urn3:EstEnRapportPrev>?</urn3:EstEnRapportPrev>
                  <!--Optional:EF_EP4_E409.07-->
                  <urn3:EstNonRemb>?</urn3:EstNonRemb>
                  <!--Optional:EF_EP4_E409.08-->
                  <urn3:EstHN>?</urn3:EstHN>
                  <!--Optional:EF_EP4_E409.22-->
                  <urn3:DCM>?</urn3:DCM>
               </urn3:LIGBIO>
               <!--Zero or more repetitions:EF_EP4_E410-->
               <urn3:LIGINFIRMIER>
                  <!--Optional:EF_EP4_E410.01-->
                  <urn3:NumLigne>?</urn3:NumLigne>
                  <!--Optional:EF_EP4_E410.02-->
                  <urn3:Detail>?</urn3:Detail>
                  <!--Optional:EF_EP4_E410.03-->
                  <urn3:EstEnRapportALD>?</urn3:EstEnRapportALD>
                  <!--Optional:EF_EP4_E410.04-->
                  <urn3:EstEnRapportAccident>?</urn3:EstEnRapportAccident>
                  <!--Optional:EF_EP4_E410.05-->
                  <urn3:EstEnRapportPrev>?</urn3:EstEnRapportPrev>
                  <!--Optional:EF_EP4_E410.06-->
                  <urn3:EstNonRemb>?</urn3:EstNonRemb>
                  <!--Optional:EF_EP4_E410.07-->
                  <urn3:EstHN>?</urn3:EstHN>
                  <!--Optional:EF_EP4_E410.08-->
                  <urn3:DCM>?</urn3:DCM>
               </urn3:LIGINFIRMIER>
               <!--Zero or more repetitions:EF_EP4_E411-->
               <urn3:LIGPEDICURE>
                  <!--Optional:EF_EP4_E411.01-->
                  <urn3:NumLigne>?</urn3:NumLigne>
                  <!--Optional:EF_EP4_E411.02-->
                  <urn3:Detail>?</urn3:Detail>
                  <!--Optional:EF_EP4_E411.03-->
                  <urn3:EstEnRapportALD>?</urn3:EstEnRapportALD>
                  <!--Optional:EF_EP4_E411.04-->
                  <urn3:EstEnRapportAccident>?</urn3:EstEnRapportAccident>
                  <!--Optional:EF_EP4_E411.05-->
                  <urn3:EstEnRapportPrev>?</urn3:EstEnRapportPrev>
                  <!--Optional:EF_EP4_E411.06-->
                  <urn3:EstNonRemb>?</urn3:EstNonRemb>
                  <!--Optional:EF_EP4_E411.07-->
                  <urn3:EstHN>?</urn3:EstHN>
                  <!--Optional:EF_EP4_E411.08-->
                  <urn3:DCM>?</urn3:DCM>
               </urn3:LIGPEDICURE>
               <!--Zero or more repetitions:EF_EP4_E412-->
               <urn3:LIGORTHOPHONISTE>
                  <!--Optional:EF_EP4_E412.01-->
                  <urn3:NumLigne>?</urn3:NumLigne>
                  <!--Optional:EF_EP4_E412.02-->
                  <urn3:Detail>?</urn3:Detail>
                  <!--Optional:EF_EP4_E412.03-->
                  <urn3:EstEnRapportALD>?</urn3:EstEnRapportALD>
                  <!--Optional:EF_EP4_E412.04-->
                  <urn3:EstEnRapportAccident>?</urn3:EstEnRapportAccident>
                  <!--Optional:EF_EP4_E412.05-->
                  <urn3:EstEnRapportPrev>?</urn3:EstEnRapportPrev>
                  <!--Optional:EF_EP4_E412.06-->
                  <urn3:EstNonRemb>?</urn3:EstNonRemb>
                  <!--Optional:EF_EP4_E412.07-->
                  <urn3:EstHN>?</urn3:EstHN>
                  <!--Optional:EF_EP4_E412.08-->
                  <urn3:DCM>?</urn3:DCM>
               </urn3:LIGORTHOPHONISTE>
               <!--Zero or more repetitions:EF_EP4_E414-->
               <urn3:LIGORTHOPTISTE>
                  <!--Optional:EF_EP4_E414.01-->
                  <urn3:NumLigne>?</urn3:NumLigne>
                  <!--Optional:EF_EP4_E414.02-->
                  <urn3:Detail>?</urn3:Detail>
                  <!--Optional:EF_EP4_E414.03-->
                  <urn3:EstEnRapportALD>?</urn3:EstEnRapportALD>
                  <!--Optional:EF_EP4_E414.04-->
                  <urn3:EstEnRapportAccident>?</urn3:EstEnRapportAccident>
                  <!--Optional:EF_EP4_E414.05-->
                  <urn3:EstEnRapportPrev>?</urn3:EstEnRapportPrev>
                  <!--Optional:EF_EP4_E414.06-->
                  <urn3:EstNonRemb>?</urn3:EstNonRemb>
                  <!--Optional:EF_EP4_E414.07-->
                  <urn3:EstHN>?</urn3:EstHN>
                  <!--Optional:EF_EP4_E414.08-->
                  <urn3:DCM>?</urn3:DCM>
               </urn3:LIGORTHOPTISTE>
            </urn2:CONTENUPRESCRIPTION>
         </urn2:PRESCRIPTION>
         <!--Optional:EF_EP4_E404-->
         <urn2:PATIENT>
            <!--Optional:EF_EP4_E404.02-->
            <urn2:Prenom>?</urn2:Prenom>
            <!--Optional:EF_EP4_E404.03-->
            <urn2:DateNai>?</urn2:DateNai>
            <!--Optional:EF_EP4_E404.04-->
            <urn2:Poids>?</urn2:Poids>
            <!--Optional:EF_EP4_E404.05-->
            <urn2:Taille>?</urn2:Taille>
         </urn2:PATIENT>
         <!--Optional:EF_EP4_E405-->
         <urn2:PRESCRIPTEUR>
            <!--Optional:EF_EP4_E405.04-->
            <urn2:Specialite>?</urn2:Specialite>
         </urn2:PRESCRIPTEUR>
         <!--Optional:EF_EP4_E415-->
         <urn2:EXECUTANT>
            <!--Optional:EF_EP4_E415.01-->
            <urn2:Nom>?</urn2:Nom>
         </urn2:EXECUTANT>
      </urn1:SE_CREEREPRESCR>
   </soap:Body>
</soap:Envelope>