CDA-FO-EPRESCRIPTION/Exemple/ep-med/e-prescription_structure_flux_Prescripteur_XML_v02.00/consulterEPrescription-Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:siram:lps:ctxlps" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:urn1="urn:ir:se_conseprescr" xmlns:urn2="urn:ir:conseprescr">   <soap:Header/>
   <soap:Header/>
   <soap:Body>
      <urn1:SE_CONSEPRESCR>
         <!--Optional:EF_EP3_E303.01-->
         <urn2:VersionNorme>?</urn2:VersionNorme>
         <!--Optional:-->
         <urn2:PRESCRIPTION>
            <!--Optional:EF_EP3_E303.02-->
            <urn2:Numero>?</urn2:Numero>
         </urn2:PRESCRIPTION>
         <!--Optional:-->
         <urn2:ACTEURDESANTE>
            <!--0 to 2 repetitions:EF_EP3_E303.03-->
            <urn2:Identifiant R="?">?</urn2:Identifiant>
            <!--Optional:EF_EP3_E303.05-->
            <urn2:IdentifiantRPPS>?</urn2:IdentifiantRPPS>
         </urn2:ACTEURDESANTE>
      </urn1:SE_CONSEPRESCR>
   </soap:Body>
</soap:Envelope>