CDA-FO-EPRESCRIPTION/Exemple/ep-med/e-prescription_structure_flux_Prescripteur_XML_v02.00/rechercherEPrescription-Response.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:ir:se_ar_recheprescr" xmlns:urn1="urn:ir:ar_recheprescr">
   <soap:Header/>
   <soap:Body>
      <urn:SE_ARRECHEPRESCR>
         <!--Optional:EF_EP2_S302.01-->
         <urn1:Horodatage>?</urn1:Horodatage>
         <!--Zero or more repetitions:EF_EP2_S398-->
         <urn1:ERREUR>
            <!--Optional:EF_EP2_S398.01-->
            <urn1:Code>?</urn1:Code>
            <!--Optional:EF_EP2_S398.02-->
            <urn1:Severite>?</urn1:Severite>
            <!--Optional:EF_EP2_S398.03-->
            <urn1:Libelle>?</urn1:Libelle>
         </urn1:ERREUR>
         <!--Zero or more repetitions:EF_EP2_S312-->
         <urn1:ARRECHEPRESCR>
            <!--Optional:-->
            <urn1:PRESCRIPTION>
               <!--Optional:EF_EP2_S312.01-->
               <urn1:Numero>?</urn1:Numero>
               <!--Optional:EF_EP2_S312.02-->
               <urn1:Type>?</urn1:Type>
               <!--Optional:EF_EP2_S312.03-->
               <urn1:SousType>?</urn1:SousType>
            </urn1:PRESCRIPTION>
            <!--Optional:-->
            <urn1:PATIENT>
               <!--Optional:EF_EP2_S312.04-->
               <urn1:NumNIR>?</urn1:NumNIR>
               <!--Optional:EF_EP2_S312.05-->
               <urn1:Rang>?</urn1:Rang>
               <!--Optional:EF_EP2_S312.06-->
               <urn1:NumNIROD>?</urn1:NumNIROD>
               <!--Optional:EF_EP2_S312.07-->
               <urn1:DateNai>?</urn1:DateNai>
               <!--Optional:EF_EP2_S312.08-->
               <urn1:MatriculeINS>?</urn1:MatriculeINS>
               <!--Optional:EF_EP2_S312.09-->
               <urn1:DateNaiINS>?</urn1:DateNaiINS>							   
            </urn1:PATIENT>
         </urn1:ARRECHEPRESCR>
      </urn:SE_ARRECHEPRESCR>
   </soap:Body>
</soap:Envelope>